emacs.d/init.org
#+title: My Emacs Config
#+property: header-args :tangle init.el

* My Emacs Config

Here is the literate version of my Emacs configuration. Everything is contained in a single org-mode file which can be tangled with =org-babel= to produce an Emacs Lisp init file.

#+BEGIN_SRC emacs-lisp
;;;;
;;
;; This file was tangled from `init.org' using Org Babel -- see that
;; file for a literate version of this configuration.
;;
;;;;
#+END_SRC


** Startup
*** Slim down the GUI

#+BEGIN_SRC emacs-lisp
(when (fboundp 'menu-bar-mode) (menu-bar-mode -1))
(when (fboundp 'tool-bar-mode) (tool-bar-mode -1))
(when (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
#+END_SRC

*** Start with a blank \*scratch\* buffer

#+BEGIN_SRC emacs-lisp
(setq inhibit-startup-screen t)
(setq initial-scratch-message nil)
#+END_SRC

*** Customize
Keep customized settings in a separate file. Load them here to set up fonts early.

#+BEGIN_SRC emacs-lisp
(setq custom-file "~/.emacs.d/custom.el")
(load custom-file 'noerror)
#+END_SRC
** General Settings
*** This is not the bell you are looking for

#+BEGIN_SRC emacs-lisp
(setq ring-bell-function 'ignore)
#+END_SRC

*** There can be only one (file encoding)

To really force UTF-8, you will need to customize =file-coding-alist=.

#+BEGIN_SRC emacs-lisp
(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
#+END_SRC

*** Backups? We don’t need no stinkin’ backups!

#+BEGIN_SRC emacs-lisp
(setq auto-save-default nil)
(setq make-backup-files nil)
#+END_SRC

*** They’re against my religion

#+BEGIN_SRC emacs-lisp
(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)
#+END_SRC

*** In (white)space, no one can see you (unless you turn on =whitespace-mode=)

[[http://ergoemacs.org/emacs/whitespace-mode.html][Simplify]] the display of whitespace characters in =whitespace-mode=, and show trailing whitespace in programming modes.

#+BEGIN_SRC emacs-lisp
(setq whitespace-style '(spaces tabs newline space-mark tab-mark newline-mark))

(setq whitespace-display-mappings
      '(
        (space-mark 32 [183] [46]) ; 32 SPACE, 183 MIDDLE DOT 「·」, 46 FULL STOP 「.」
        (newline-mark 10 [182 10]) ; 10 LINE FEED
        (tab-mark 9 [9655 9] [92 9]) ; 9 TAB, 9655 WHITE RIGHT-POINTING TRIANGLE 「▷」
        ))

(add-hook 'prog-mode-hook
          (lambda ()
            (setq show-trailing-whitespace t)))
#+END_SRC
*** I don’t need your help (I have the [f1] key)

#+BEGIN_SRC emacs-lisp
(define-key key-translation-map [?\C-h] [?\C-?])
#+END_SRC

*** Beautiful snowflakes

#+BEGIN_SRC emacs-lisp
(require 'uniquify)
(setq uniquify-buffer-name-style 'forward)
#+END_SRC

*** Sentences end with a single space
#+begin_src emacs-lisp
(setq sentence-end-double-space nil)
#+end_src

*** Electrify me

#+BEGIN_SRC emacs-lisp
(electric-indent-mode 1)
#+END_SRC

*** SHOW ME (the matching parens)

#+BEGIN_SRC emacs-lisp
(add-hook 'prog-mode-hook
          (lambda ()
            (show-paren-mode)))
#+END_SRC
** OS-Specific Settings and Directories

On Windows, emacs (or the =runemacs.exe= binary) starts up in the folder it lives in, and the =HOME= environment variable is set to the =%APPDATA%/Roaming= folder. This is rather inconvenient, so the first thing to do is to create a new shortcut to =runemacs.exe= named ‘emacs’, and set the “Start In:” property to, say, =C:\\Users\\<username>=. This shortcut can live anywhere; I have it pinned to my taskbar. The =HOME= variable we leave alone, since it is used by Emacs to find the =.emacs.d= directory. We don’t need it anyway. For convenience we define some useful directories as constants.

*** Testing OS type

#+BEGIN_SRC emacs-lisp
(defun windows-p ()
  (eq system-type 'windows-nt))
#+END_SRC

*** Path-munging functions

#+BEGIN_SRC emacs-lisp
(defun add-to-path-string (dir path)
  (if (string-equal "" (or path ""))
      dir
    (concat dir path-separator path)))

(defun add-to-exec-path (dir)
  (setenv "PATH"
          (add-to-path-string
           (expand-file-name dir "~")
           (getenv "PATH")))
  (add-to-list 'exec-path dir))
#+END_SRC

*** Linux-only

On Linux, I keep some useful scripts and executables in =~/.local/bin/=.

#+BEGIN_SRC emacs-lisp
(unless (windows-p)
  (add-to-exec-path (expand-file-name ".local/bin" "~")))
#+END_SRC

*** Define directory constants

#+BEGIN_SRC emacs-lisp
(defconst dir/emacsd (file-name-as-directory
                      (expand-file-name ".emacs.d" (getenv "HOME")))
  "Emacs configuration directory.")

(defconst dir/home (file-name-as-directory
                    (if (windows-p)
                        (getenv "USERPROFILE")
                      (expand-file-name "~")))
  "User's home directory.")

(defconst dir/org (file-name-as-directory
                   (expand-file-name
                    (if (windows-p)
                        "Documents/Org"
                      "Org")
                    dir/home))
  "Org file directory.")
#+END_SRC

** Useful stuff
*** Keybindings

There are a lot of things that are useful to toggle on and off; various minor modes such as =whitespace-mode=, line truncation, etc. We define a common keymap to use for these commands:
#+BEGIN_SRC emacs-lisp
(setq toggle/prefix "C-x t")
(setq toggle/keymap (make-sparse-keymap))

(defun toggle/bind-key (key command)
  (define-key toggle/keymap key command))

(global-set-key (kbd toggle/prefix) toggle/keymap)
#+END_SRC

Go ahead and define some toggle commands for built in stuff:
#+BEGIN_SRC emacs-lisp
(toggle/bind-key "l" 'whitespace-mode)
(toggle/bind-key "w" 'toggle-truncate-lines)
(toggle/bind-key "e" 'electric-indent-mode)
#+END_SRC

*** Winner mode

Winner mode saves and restores window configurations. Enable it.
#+BEGIN_SRC emacs-lisp
(winner-mode 1)
#+END_SRC

** Packages
*** Initialization

We need to initialize the package system and manually install and load [[https://github.com/jwiegley/use-package][use-package]] so that we can use it to manage other packages.

Load =package.el=:
#+BEGIN_SRC emacs-lisp
(require 'package)
#+END_SRC

Add the MELPA and Org-mode repositories:
#+BEGIN_SRC emacs-lisp
(add-to-list 'package-archives
             '("melpa" . "http://melpa.milkbox.net/packages/") t)
(add-to-list 'package-archives
             '("org" . "http://orgmode.org/elpa/") t)
#+END_SRC
The Org-mode ELPA repository can be used to install the latest released version of org-mode, but it must be installed manually to override the built-in version.

Initialize the package system and download a list of packages if it doesn’t exist (i.e. on a new system or it has been removed manually):
#+BEGIN_SRC emacs-lisp
(package-initialize)

(unless package-archive-contents
  (package-refresh-contents))
#+END_SRC

Now install and require use-package:
#+BEGIN_SRC emacs-lisp
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
#+END_SRC

And now we are ready to use =use-package= to configure our packages, and it will even download them for us!
*** Evil

Load evil first because we will want to configure powerline and key bindings for some later packages:

#+BEGIN_SRC emacs-lisp
(use-package evil
  :ensure t
  :demand t
  :init
  (progn
    ; from https://github.com/syl20bnr/spacemacs/blob/master/spacemacs/packages.el
    (setq evil-mode-line-format 'before)
    (setq evil-emacs-state-cursor  '("red" box))
    (setq evil-normal-state-cursor '("orange" box))
    (setq evil-visual-state-cursor '("black" box))
    (setq evil-insert-state-cursor '("green3" bar))
    (setq evil-motion-state-cursor '("purple" box))
    )
  :config
  (progn

    ; load evil-leader before (evil-mode 1)
    (use-package evil-leader
      :ensure t
      :init
      (progn
        (evil-leader/set-leader ",")
        (global-evil-leader-mode))
      :config
      (progn
        (evil-leader/set-key "t" toggle/keymap)
        ))

    (evil-mode 1)

    (use-package evil-surround
      :ensure t
      :init (global-evil-surround-mode 1))

    ;; add useful keys
    (define-key evil-normal-state-map (kbd "C-w q") 'evil-quit)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)

    ;; unbind keys
    ;; insert
    (define-key evil-insert-state-map (kbd "C-e") nil)
    (define-key evil-insert-state-map (kbd "C-p") nil)
    (define-key evil-insert-state-map (kbd "C-n") nil)
    ;; normal
    (define-key evil-normal-state-map (kbd "C-p") nil)
    (define-key evil-normal-state-map (kbd "C-n") nil)
    (define-key evil-normal-state-map (kbd "M-.") nil)
    ))
#+END_SRC

