emacs.d/init.org
*** Theme and Powerline

The powerline config is mostly from: https://github.com/syl20bnr/spacemacs/blob/master/spacemacs/packages.el.
#+BEGIN_SRC emacs-lisp
(use-package powerline
  :ensure t
  :demand t
  :config
  (progn
    (toggle/bind-key "m" 'powerline-minor-modes-toggle)

    (defun propertize-evil-mode-line-tag ()
      (propertize evil-mode-line-tag 'font-lock-face
                  ;; Don't propertize if we're not in the selected buffer
                  (cond ((not (eq (current-buffer) (car (buffer-list)))) '())
                        ((evil-insert-state-p) '(:background "green3" :foreground "black"))
                        ((evil-emacs-state-p)  '(:background "red" :foreground "black"))
                        ((evil-motion-state-p) '(:background "purple" :foreground "black"))
                        ((evil-visual-state-p) '(:background "gray" :foreground "black"))
                        ((evil-normal-state-p)  '(:background "orange" :foreground "black"))
                        (t '()))))

    (defpowerline powerline-evil-mode (propertize-evil-mode-line-tag))

    (defvar powerline-minor-modes-p t)
    (defun powerline-minor-modes-toggle ()
      "Toggle display of minor modes."
      (interactive)
      (if powerline-minor-modes-p
          (setq powerline-minor-modes-p nil)
        (setq powerline-minor-modes-p t)))

    (defun my-powerline-theme ()
      "Set up my powerline theme with evil mode etc."
      (interactive)
      (setq-default mode-line-format
                    '("%e"
                      (:eval
                       (let* ((active (eq (frame-selected-window) (selected-window)))
                              (face1 (if active 'powerline-active1 'powerline-inactive1))
                              (face2 (if active 'powerline-active2 'powerline-inactive2))
                              (lhs (append (list
                                            ;; (powerline-window-number face1 'l)
                                            (powerline-evil-mode face1 'l)

                                            (powerline-raw "%*" nil 'l)
                                            (powerline-buffer-size nil 'l)
                                            (powerline-buffer-id nil 'l)
                                            (powerline-raw " " nil)

                                            (powerline-arrow-right nil face1)
                                            (powerline-major-mode face1 'l)
                                            (powerline-raw " " face1))

                                           (if powerline-minor-modes-p
                                               (list (powerline-arrow-right face1 nil)
                                                     (powerline-minor-modes nil 'l)
                                                     (powerline-raw mode-line-process nil 'l)
                                                     (powerline-raw " " nil)
                                                     (powerline-arrow-right nil face2))
                                             (list (powerline-raw " " face1)
                                                   (powerline-arrow-right face1 face2)))

                                           (list (powerline-vc face2))))
                              (rhs (list
                                    (powerline-raw global-mode-string face2 'r)
                                    (powerline-raw " " face2)

                                    (powerline-arrow-left face2 face1)
                                    (powerline-raw " " face1)
                                    (powerline-raw "%l:%2c" face1 'r)
                                    (powerline-arrow-left face1 nil)
                                    (powerline-raw " " nil)
                                    (powerline-raw "%p" nil 'r)

                                    (powerline-hud face2 face1))))
                         (concat
                          (powerline-render lhs)
                          (powerline-fill face2 (powerline-width rhs))
                          (powerline-render rhs)))))))

    ;; setting the powerline mode line in 'after-init-hook solves problems with other packages screwing it up (looking at you, workgroups2!)
    (add-hook 'after-init-hook (lambda () (my-powerline-theme)))
    ))
#+END_SRC

Load a theme:
#+BEGIN_SRC emacs-lisp
(use-package moe-theme
  :ensure t
  :config
  (progn
    ;; Resize titles
    ;; (setq moe-theme-resize-markdown-title '(2.0 1.7 1.5 1.3 1.0 1.0))
    ;; (setq moe-theme-resize-org-title '(2.2 1.8 1.6 1.4 1.2 1.0 1.0 1.0 1.0))
    ;; (setq moe-theme-resize-rst-title '(2.0 1.7 1.5 1.3 1.1 1.0))

    (setq moe-theme-mode-line-color 'green)

    (moe-dark)
    (powerline-moe-theme)
    ))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no
(use-package ample-theme
  :ensure t
  :config (load-theme 'ample t))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no
(use-package zenburn-theme
  :ensure t
  :config
  (progn (load-theme 'zenburn t)))
#+END_SRC

*** Org Mode

#+BEGIN_SRC emacs-lisp
(use-package org
  :defer t
  :commands org-agenda
  :init
  (progn
    ;; general org-mode behavior
    (setq org-directory dir/org
          org-startup-indented t
          org-startup-folded 'content
          org-use-speed-commands t
          org-catch-invisible-edits 'error
          )

    ;; org-agenda
    (define-key global-map (kbd "C-c a") 'org-agenda)
    (setq org-agenda-files (list (expand-file-name "agenda.org" dir/org))
          org-agenda-span 'month
          org-agenda-window-setup 'current-window
          org-log-done t
          )

    ;; enable org-export backends
    (setq org-export-backends '(ascii html latex beamer))
    )
  :config
  (progn

    ;; configure sub packages and other packages used with org-mode
    (use-package org-indent :diminish "")
    (use-package htmlize :ensure t)


    ;; do more intensive customization of org export:
    ;; - latex
    (setq org-latex-pdf-process '("latexmk -g -xelatex %f")
          org-latex-default-packages-alist nil
          org-latex-packages-alist '(("" "graphicx" nil) ("" "float" nil))
          org-latex-default-class "default"
          )
    (setq org-latex-classes ; this really calls for a macro
          '(
            ("default"
             "\\documentclass[11pt]{article}
[PACKAGES]
\\usepackage{amssymb}
\\usepackage{fontspec}
\\usepackage{xunicode}
\\usepackage{url}
\\usepackage{hyperref}"
             ("\\section{%s}" . "\\section*{%s}")
             ("\\subsection{%s}" . "\\subsection*{%s}")
             ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
             ("\\paragraph{%s}" . "\\paragraph*{%s}")
             ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))

            ("beamer"
             "\\documentclass{beamer}
[PACKAGES]
\\usepackage{amssymb}
\\usepackage{fontspec}
\\usepackage{xunicode}
\\usepackage{url}
\\usepackage{hyperref}
\\setbeamertemplate{navigation symbols}{}
"
             ("\\section{%s}" . "\\section*{%s}")
             ("\\subsection{%s}" . "\\subsection*{%s}")
             ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
             ("\\paragraph{%s}" . "\\paragraph*{%s}")
             ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))
            ))


    ;; org-babel for literate programming
    (org-babel-do-load-languages
     'org-babel-load-languages
     '(
       (clojure . t)
       (emacs-lisp . t)
       (gnuplot . t)
       (python . t)
       (sh . t)
      )
    )
    (setq org-src-fontify-natively t)
    (setq org-src-preserve-indentation t)
    ))
#+END_SRC

**** TODO split into sub-blocks using noweb

**** TODO create macro to make configuring latex classes and packages easier and more flexible

**** TODO improve org-babel configuration

*** Magit

#+BEGIN_SRC emacs-lisp
(use-package magit
  :ensure t
  :commands magit-status
  :diminish magit-auto-revert-mode
  :bind ("C-x g" . magit-status)
  :config
  (define-key magit-status-mode-map (kbd "k") nil)
  (define-key magit-status-mode-map (kbd "K") 'magit-discard-item)
  )
#+END_SRC

