emacs.d/init.org
*** Helm

See helm configs at [[https://github.com/bbatsov/prelude][Prelude]] and [[http://tuhdo.github.io/helm-intro.html][A Package in a league of its own: Helm]]
.
#+begin_src emacs-lisp
(use-package helm
  :ensure t
  :diminish ""
  :init
  (progn

    (setq helm-command-prefix-key "C-c h")

    (require 'helm-config)
    (require 'helm-eshell)
    (require 'helm-files)
    (require 'helm-grep)

    (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action)
    (define-key helm-map (kbd "C-i") 'helm-execute-persistent-action)
    (define-key helm-map (kbd "C-z")  'helm-select-action)

    (setq helm-candidate-number-limit 10)

    (setq helm-idle-delay 0.1
          helm-input-idle-delay 0.01
          helm-quick-update t
          helm-M-x-requires-pattern nil
          helm-ff-skip-boring-files t
          helm-buffers-fuzzy-matching t
          helm-ff-file-name-history-use-recentf t
          helm-move-to-line-cycle-in-source t
          helm-split-window-default-side 'other
          helm-split-window-in-side-p t
          )

    (evil-leader/set-key ":" 'helm-M-x
                         "b" 'helm-mini)


    (global-set-key (kbd "C-c h o") 'helm-occur)
    (global-set-key (kbd "C-c h g") 'helm-do-grep)

    (helm-mode)

    (use-package helm-gtags
      :ensure t
      :defer t
      :diminish ""
      :init
      (progn
        (setq helm-gtags-prefix-key "\C-cg"
              helm-gtags-suggested-key-mapping nil
              helm-gtags-ignore-case t
              helm-gtags-auto-update t
              helm-gtags-use-input-at-cursor t
              helm-gtags-pulse-at-cursor t
              )

        (add-hook 'dired-mode-hook 'helm-gtags-mode)
        (add-hook 'eshell-mode-hook 'helm-gtags-mode)
        (add-hook 'prog-mode-hook 'helm-gtags-mode)
        )
      :config
      (progn
        (global-set-key (kbd "M-.") 'helm-gtags-dwim)
        ;; (define-key helm-gtags-mode-map (kbd "M-,") 'helm-gtags-pop-stack)
        ;; (define-key helm-gtags-mode-map (kbd "C-c <") 'helm-gtags-previous-history)
        ;; (define-key helm-gtags-mode-map (kbd "C-c >") 'helm-gtags-next-history)
        ))
    ))
#+end_src

*** Completion

#+BEGIN_SRC emacs-lisp
(use-package company
  :ensure t
  :diminish ""
  :config
  (progn

    (use-package semantic
      :diminish abbrev-mode
      :disabled t
      :config
      (progn
        (global-semanticdb-minor-mode 1)
        (global-semantic-idle-scheduler-mode 1)
        (global-semantic-stickyfunc-mode 1)

        (semantic-mode 1)
        ))

    (use-package company-irony
      :ensure t
      :if (not (windows-p))
      :diminish ""
      :config
      (use-package irony-mode
        :commands irony-mode
        :config
        (add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options)
        )
      (add-to-list 'company-backends 'company-irony)
      )

    (global-company-mode)
    ))
#+END_SRC

*** TeX modes

#+BEGIN_SRC emacs-lisp
(use-package tex
  :mode ("\\.tex\\'" . latex-mode)
  :ensure auctex)
(use-package reftex
  :ensure t)
#+END_SRC

*** Programming language modes

**** Clojure

#+BEGIN_SRC emacs-lisp
(use-package clojure-mode
  :ensure t
  :mode "\\.clj\\'")

(use-package cider
  :defer t
  :ensure t)
#+END_SRC

**** Gnuplot

#+BEGIN_SRC emacs-lisp
(use-package gnuplot
  :ensure t
  :commands gnuplot-mode)
#+END_SRC

**** Julia

#+BEGIN_SRC emacs-lisp
(use-package julia-mode
  :load-path "~/.emacs.d/elisp/"
  :mode "\\.jl\\'")
#+END_SRC

**** Python

#+BEGIN_SRC emacs-lisp
(use-package python
  :commands python-mode
  :mode ("wscript\\'" . python-mode))
#+END_SRC

**** Lua

#+BEGIN_SRC emacs-lisp
(use-package lua-mode
  :ensure t
  :commands lua-mode
  :mode "\\.lua\\'")
#+END_SRC

**** C++

#+BEGIN_SRC emacs-lisp
(use-package cc-mode
  :commands (c-mode c++-mode)
  :mode ("\\.h\\(pp|h\\)?\\'" . c++-mode)
  :config

  (defun my-c-mode-common-hook ()
    ;; http://programmers.stackexchange.com/q/87250
    (font-lock-add-keywords nil
                            '(("\\<\\(assert\(.*\);\\)" 1 '(:foreground "#444444") t)
                              ("\\<assert\\(\(.*\);\\)" 1 '(:foreground "#666666") t)))
    )

  (defun my-c++-mode-hook ()
    (irony-mode)
    )
  :init
  (add-hook 'c-mode-common-hook 'my-c-mode-common-hook)
  (add-hook 'c++-mode-hook 'my-c++-mode-hook)
  )
#+END_SRC

*** Other major modes

**** Markdown

#+BEGIN_SRC emacs-lisp
(use-package markdown-mode
  :ensure t
  :commands markdown-mode)
#+END_SRC

**** Tup

#+BEGIN_SRC emacs-lisp
(use-package tup-mode
  :ensure t
  :commands tup-mode
  :mode "Tupfile.ini")
#+END_SRC

*** Unicycle mode

#+BEGIN_SRC emacs-lisp
(use-package unicycle-mode
  :load-path "~/.emacs.d/elisp/"
  :commands unicycle-mode
  :diminish (unicycle-mode . " ¶")
  :init (toggle/bind-key "u" 'unicycle-mode))
#+END_SRC

*** Undo-Tree mode

=undo-tree= is already installed and required as a dependency of some other package (org mode?), so all we do here is diminish it.

#+BEGIN_SRC emacs-lisp
(use-package undo-tree
  :diminish "")
#+END_SRC

*** Workgroups

Use workgroups2 because the original package doesn't seem to be maintained.

#+BEGIN_SRC emacs-lisp
(use-package workgroups2
  :ensure t
  :diminish (workgroups-mode . "")
  :config
  (setq wg-mode-line-display-on nil)
  (setq wg-prefix-key (kbd "C-c z"))
  (setq wg-session-file "~/.emacs.d/workgroups")
  :init
  (workgroups-mode 1)
  )
#+END_SRC
