emacs.d/init.el

(use-package helm
  :ensure t
  :diminish ""
  :init
  (progn

    (setq helm-command-prefix-key "C-c h")

    (require 'helm-config)
    (require 'helm-eshell)
    (require 'helm-files)
    (require 'helm-grep)

    (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action)
    (define-key helm-map (kbd "C-i") 'helm-execute-persistent-action)
    (define-key helm-map (kbd "C-z")  'helm-select-action)

    (setq helm-candidate-number-limit 10)

    (setq helm-idle-delay 0.1
          helm-input-idle-delay 0.01
          helm-quick-update t
          helm-M-x-requires-pattern nil
          helm-ff-skip-boring-files t
          helm-buffers-fuzzy-matching t
          helm-ff-file-name-history-use-recentf t
          helm-move-to-line-cycle-in-source t
          helm-split-window-default-side 'other
          helm-split-window-in-side-p t
          )

    (evil-leader/set-key ":" 'helm-M-x
                         "b" 'helm-mini)


    (global-set-key (kbd "C-c h o") 'helm-occur)
    (global-set-key (kbd "C-c h g") 'helm-do-grep)

    (helm-mode)

    (use-package helm-gtags
      :ensure t
      :defer t
      :diminish ""
      :init
      (progn
        (setq helm-gtags-prefix-key "\C-cg"
              helm-gtags-suggested-key-mapping nil
              helm-gtags-ignore-case t
              helm-gtags-auto-update t
              helm-gtags-use-input-at-cursor t
              helm-gtags-pulse-at-cursor t
              )

        (add-hook 'dired-mode-hook 'helm-gtags-mode)
        (add-hook 'eshell-mode-hook 'helm-gtags-mode)
        (add-hook 'prog-mode-hook 'helm-gtags-mode)
        )
      :config
      (progn
        (global-set-key (kbd "M-.") 'helm-gtags-dwim)
        ;; (define-key helm-gtags-mode-map (kbd "M-,") 'helm-gtags-pop-stack)
        ;; (define-key helm-gtags-mode-map (kbd "C-c <") 'helm-gtags-previous-history)
        ;; (define-key helm-gtags-mode-map (kbd "C-c >") 'helm-gtags-next-history)
        ))
    ))

(use-package company
  :ensure t
  :diminish ""
  :config
  (progn

    (use-package semantic
      :diminish abbrev-mode
      :config
      (progn
        (global-semanticdb-minor-mode 1)
        (global-semantic-idle-scheduler-mode 1)
        (global-semantic-stickyfunc-mode 1)

        (semantic-mode 1)
        ))

    (global-company-mode)
    ))

(use-package tex
  :mode ("\\.tex\\'" . latex-mode)
  :ensure auctex)
(use-package reftex
  :ensure t)

(use-package clojure-mode
  :ensure t
  :mode "\\.clj\\'")

(use-package cider
  :defer t
  :ensure t)

(use-package gnuplot
  :ensure t
  :commands gnuplot-mode)

(use-package julia-mode
  :load-path "~/.emacs.d/elisp/"
  :mode "\\.jl\\'")

(use-package python
  :commands python-mode
  :mode ("wscript\\'" . python-mode))

(use-package lua-mode
  :ensure t
  :commands lua-mode
  :mode "\\.lua\\'")

(use-package cc-mode
  :commands (c-mode c++-mode)
  :mode ("\\.h\\(pp|h\\)?\\'" . c++-mode)
  :config

  ;; http://programmers.stackexchange.com/q/87250
  ; gray out the "assert(...)" wrapper
  (add-hook 'c-mode-common-hook
            (lambda ()
              (font-lock-add-keywords nil
                                      '(("\\<\\(assert\(.*\);\\)" 1 '(:foreground "#444444") t)))))

  ; gray out the stuff inside parenthesis with a slightly lighter color
  (add-hook 'c-mode-common-hook
            (lambda ()
              (font-lock-add-keywords nil
                                      '(("\\<assert\\(\(.*\);\\)" 1 '(:foreground "#666666") t)))))
  )

(use-package markdown-mode
  :ensure t
  :commands markdown-mode)

(use-package tup-mode
  :ensure t
  :commands tup-mode
  :mode "Tupfile.ini")

(use-package unicycle-mode
  :load-path "~/.emacs.d/elisp/"
  :commands unicycle-mode
  :diminish " ¶"
  :init (toggle/bind-key "u" 'unicycle-mode))

(use-package undo-tree
  :diminish "")
